[
{"name":"Programming and data analytics",
"time":"8",
"description":"R is a programming language that can help you in your data analysis process. In this part of the course, you’ll learn about R and RStudio, the environment you’ll use to work in R. You’ll explore the benefits of using R and RStudio as well as the components of RStudio that will help you get started."},
{"name":"Programming using RStudio",
"time":"5",
"description":"Using R can help you complete your analysis efficiently and effectively. In this part of the course, you’ll explore the fundamental concepts associated with R. You’ll learn about functions and variables for calculations and other programming. In addition, you'll discover R packages, which are collections of R functions, code and sample data that you’ll use in RStudio."},
{"name":"Working with data in R",
"time":"8",
"description":"The R programming language was designed to work with data at all stages of the data analysis process. In this part of the course, you’ll examine how R can help you structure, organize, and clean your data using functions and other processes. You’ll learn about data frames and how to work with them in R. You’ll also revisit the issue of data bias and how R can help."},
{"name":"More about visualizations, aesthetics, and annotations",
"time":"9",
"description":"R is a tool well-suited for creating detailed visualizations. In this part of the course, you’ll learn how to use R to generate and troubleshoot visualizations. You’ll also explore the features of R and RStudio that will help you with the aesthetics of your visualizations and for annotating and saving them."},
{"name":"Documentation and reports",
"time":"8",
"description":"When you’re ready to save and present your analysis, R has different options to consider. In this part of the course, you’ll explore R Markdown, a file format for making dynamic documents with R. You’ll find out how to format and export R Markdown, including how to incorporate R code chunks in your documents."}


]